Repository: ContaoBlackForest/contao-dropzone
Catalog: src/Resources/contao/languages/*/*_newsletter_channel.xlf
Languages: de

# tl_newsletter_channel.dropzone_legend
source: Dropzone settings
de: Dropzone-Einstellungen

# tl_newsletter_channel.dropzoneFolder.0
source: Upload folder
de: Upload Verzeichnis

# tl_newsletter_channel.dropzoneFolder.1
source: Here you can define the upload directory. This directory is used in the newsletter.
de: Hier können Sie das Upload Verzeichnis definieren. Diese Verzeichnis wird im Newsletter benutzt.

# tl_newsletter_channel.dropzoneTitleInFolder.0
source: Title in path
de: Titel im Pfad

# tl_newsletter_channel.dropzoneTitleInFolder.1
source: If this option is activated, the title of the newsletter channel in the upload path is used as an alias.
de: Wenn diese Option aktiviert ist, wird der Titel des Newsletter Verteilers im Upload-Pfad als Alias benutzt.

# tl_newsletter_channel.dropzoneAliasInFolder.0
source: News-Alias in path
de: Nachrichten-Alias im Pfad

# tl_newsletter_channel.dropzoneAliasInFolder.1
source: If this option is enabled, the alias of the newsletter in the path is used.
de: Wenn Sie diese Option aktiviert ist, wird der Alias des Newsletters im Pfad benutzt.

# tl_newsletter_channel.dropzoneExtendFolderPath.0
source: Extending the Upload Directory
de: Upload-Verzeichnis erweitern

# tl_newsletter_channel.dropzoneExtendFolderPath.1
source: If active, you can extend the upload directory.
de: Wenn aktiv können Sie das Upload-Verzeichnis erweitern.

# tl_newsletter_channel.dropzoneFolderChunks.0
source: Upload directory extensions
de: Upload-Verzeichnis Erweiterungen

# tl_newsletter_channel.dropzoneFolderChunks.1
source: Here the additional upload directory parts are determined. For example, you can use insert tags to dynamically extend the path.
de: Hier werden die zusätzlichen Upload-Verzeichnis Teile bestimmt. Sie können z.B. mit Hilfe der Inserttags den Pfad dynamisch erweitern.

# tl_newsletter_channel.dropzoneNotOverride.0
source: Do not overwrite
de: Nicht überschreiben

# tl_newsletter_channel.dropzoneNotOverride.1
source: If this setting is active, existing files are not overwritten. If the file with the same name exists, the file name is extended with the postfix and the counter.
de: Ist diese Einstellung aktiv, werden bestehende Dateien nicht überschrieben. Wenn die Datei mit dem selben Namen vorhanden ist, wird der Dateinamen mit dem Postfix und dem Counter erweitert.

# tl_newsletter_channel.dropzonePostfix.1
source: Here you can specify the postfix for the file name. This is appended to the file name if the file name exists.
de: Hier können Sie den Postfix für den Dateinamen angeben. Dieser wird wenn der Dateinamen vorhanden an den Dateinamen angehängt.

# tl_newsletter_channel.dropzoneCounterLength.1
source: This sets the initial counter length for the existing file name, which is appended to the file name.
de: Hier wird die anfängliche Counterlänge für den vorhandene Dateinamen eingestellt, dieser wird an den Dateinamen angehängt.
